src/InformationRegisters/дкл_ОчередьСообщений/дкл_ОчередьСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_ОчередьСообщений</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.дкл_ТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.дкл_НаправлениеСообщения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_ТипыСообщений/дкл_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_ТипыСообщений</name>
  <enumValues>
    <name>changeOrderStatus</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v16</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v21</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v21_HTTP</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v25</name>
  </enumValues>
  <enumValues>
    <name>submitOrder</name>
  </enumValues>
  <enumValues>
    <name>submitRetrievalOrders</name>
  </enumValues>
  <enumValues>
    <name>submitStorageOrders</name>
  </enumValues>
  <enumValues>
    <name>uploadItemList</name>
  </enumValues>
  <enumValues>
    <name>uploadUserList</name>
  </enumValues>
</mdclass:Enum>

src/Enums/дкл_НаправлениеСообщения/дкл_НаправлениеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_НаправлениеСообщения</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
</mdclass:Enum>

src/WebServices/OrderService/Module.bsl
Функция submitOrder(machineId =  Неопределено, order = Неопределено)                 
	
	Результат = Справочники.дкл_НастройкиСкладовЛифтов.НайтиНастройкуСкладаПоИдентификатору(machineId);
	
	ЗаписьХМЛ  = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьХМЛ, order);
	Сообщение = ЗаписьХМЛ.Закрыть();

	ДанныеСообщенияОбмена = дкл_ОбменДаннымиСервер.ИнициализироватьДанныеСообщенияОбмена();
	ДанныеСообщенияОбмена.Обработано = Ложь;
	ДанныеСообщенияОбмена.ТипСообщения = Перечисления.дкл_ТипыСообщений.submitOrder;
	ДанныеСообщенияОбмена.Направление = Перечисления.дкл_НаправлениеСообщения.Входящее;
	ДанныеСообщенияОбмена.НастройкаСклада = Результат.НастройкаСклада;
	ДанныеСообщенияОбмена.Сообщение = Сообщение;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрыСведений.дкл_ОчередьСообщений");
	МенеджерОбъекта.ЗаписатьСообщениеВОчередьСообщений(ДанныеСообщенияОбмена);
	
	// выгружать online...                                       
	Результат = МенеджерОбъекта.Выгрузить(ДанныеСообщенияОбмена); 
	
	// обработаем не обработанные по каким-то причинам сообщения (кроме текущего)
	МенеджерОбъекта.ОбработкаОчередиСообщений( ,ДанныеСообщенияОбмена.IDСообщения);
	
	Возврат Истина; // Результат;
	
КонецФункции
